app/Models/ModelTransaksi.php

    public function getTransaksi()
    {
        $builder = $this->db->table('tbl_transaksi')
            ->join('tbl_pelanggan', 'idpel=id')
            ->join('tbl_tarif', 'idharga=idtarif');
        return $builder->get();
---
SELECT *
FROM `tbl_transaksi`
JOIN `tbl_pelanggan` ON `idpel`=`id`
JOIN `tbl_tarif` ON `idharga`=`idtarif`

    public function getPelanggan()
    {
        $builder = $this->db->table('tbl_pelanggan');
        return $builder->get();
---
SELECT *
FROM `tbl_pelanggan`

    public function getTarif()
    {
        $builder = $this->db->table('tbl_tarif');
        return $builder->get();
---
SELECT *
FROM `tbl_tarif`

    public function insertData($data)
    {
        $this->db->table('tbl_transaksi')->insert($data);
---
INSERT INTO `tbl_transaksi` (`idpel`, `idharga`, `meterbulanini`, `meterbulanlalu`, `tglbayar`) VALUES ('P001', '004', '200', '100', '2024-01-26')