app/Models/ModelTarif.php

SELECT *
FROM `tbl_tarif`
---
    public function getTarif()
    {
        $builder = $this->db->table('tbl_tarif');
        return $builder->get();